---
kind: method
id: M:Autodesk.Revit.DB.ExternalService.IExternalServer.GetVendorId
source: html/76cf499a-4a59-9249-8995-e1ab9e629f37.htm
---
# Autodesk.Revit.DB.ExternalService.IExternalServer.GetVendorId Method

Implement this method to return the id of the vendor of the server.

## Syntax (C#)
```csharp
string GetVendorId()
```

## Returns
Vendor Id of the server.

## Remarks
The Id is expected to be a string consisting of 4 characters.